Repository: Kimcao1217/ClipStackApp
Catalog: ClipStack/ClipStackKeyboard/Localizable.xcstrings
Source language: en
Languages: zh_hans

# addItem.contentLabel
source: Content
zh_hans: 内容

# addItem.sourceLabel
source: Source App
zh_hans: 来源应用

# addItem.sourcePlaceholder
source: Enter app name (optional)
zh_hans: 输入来源应用名称（可选）

# addItem.title
source: Add Item
zh_hans: 添加新条目

# alert.clearHistoryMessage
source: This will permanently delete %d clipboard items. This action cannot be undone.
zh_hans: 这将永久删除 %d 条剪贴板历史记录，此操作无法撤销。

# alert.clearStarredMessage
source: This will permanently delete %d starred items. This action cannot be undone.
zh_hans: 这将永久删除 %d 个收藏条目，此操作无法撤销。

# alert.deleteMessage
source: This cannot be undone
zh_hans: 删除后无法恢复

# alert.deleteTitle
source: Delete Item
zh_hans: 确认删除

# alert.ok
source: OK
zh_hans: 好的

# alert.resetAllMessage
source: This will permanently delete %lld history items and %lld starred items, and reset all settings. This action cannot be undone.
zh_hans: 这将永久删除 %1$lld 条历史记录和 %2$lld 个收藏，并重置所有设置。此操作无法撤销。

# app.contentEmpty
source: Content is empty
zh_hans: 内容为空

# app.copied
source: Copied
zh_hans: 已复制

# app.imageCopied
source: Image copied
zh_hans: 图片已复制

# app.imageLoadFailed
source: Failed to load image
zh_hans: 图片加载失败

# app.itemNotFound
source: Item not found
zh_hans: 条目不存在

# app.loadFailed
source: Failed to load
zh_hans: 加载失败

# common.cancel
source: Cancel
zh_hans: 取消

# common.close
source: Close
zh_hans: 关闭

# common.confirm
source: Confirm
zh_hans: 确认

# common.copy
source: Copy
zh_hans: 复制

# common.delete
source: Delete
zh_hans: 删除

# common.done
source: Done
zh_hans: 完成

# common.empty
source: No Content
zh_hans: 暂无内容

# common.error
source: Error
zh_hans: 错误

# common.loading
source: Loading...
zh_hans: 加载中...

# common.save
source: Save
zh_hans: 保存

# common.settings
source: Settings
zh_hans: 设置

# common.share
source: Shared
zh_hans: 分享

# common.success
source: Success
zh_hans: 成功

# detail.copyContent
source: Copy
zh_hans: 复制

# detail.createdAt
source: Created
zh_hans: 创建时间

# detail.openInSafari
source: Open in Safari
zh_hans: 在 Safari 中打开

# detail.source
source: Source
zh_hans: 来源

# detail.title
source: Details
zh_hans: 详情

# empty.history.message
source: Start by saving content from the Share menu or tapping the + button above
zh_hans: 从分享菜单或点击右上角的 + 按钮添加内容开始使用

# empty.history.title
source: No History Yet
zh_hans: 还没有剪贴板历史

# error.alertTitle
source: Operation Failed
zh_hans: 操作失败

# error.appGroupPathFailed
source: Unable to access App Group container
zh_hans: 无法获取 App Group 共享容器路径

# error.cleanupFailed
source: Failed to clean up history
zh_hans: 清理历史记录失败

# error.coreDataLoadFailed
source: Core Data failed to load
zh_hans: Core Data 加载失败

# error.deleteFailed
source: Delete failed
zh_hans: 删除失败

# error.deleteFailedDetail
source: Delete failed: %@
zh_hans: 删除失败：%@

# error.loadSettingsFailed
source: Failed to load settings data
zh_hans: 加载设置数据失败

# error.previewDataFailed
source: Failed to create preview data
zh_hans: 预览数据创建失败

# error.queryStarredFailed
source: Failed to query starred items
zh_hans: 查询收藏数失败

# error.saveFailed
source: Save failed
zh_hans: 保存失败

# feedback.body
source: --- Version: %@ System: %@ Device: %@
zh_hans: --- 版本: %@ 系统: %@ 设备: %@

# feedback.subject
source: ClipStack Feedback
zh_hans: ClipStack 反馈

# filter.all
source: All
zh_hans: 全部

# filter.empty
source: No %@ Items
zh_hans: 暂无%@内容

# filter.image
source: Images
zh_hans: 图片

# filter.link
source: Links
zh_hans: 链接

# filter.starred
source: Starred
zh_hans: 收藏

# filter.switchToAll
source: Switch to "All" to view all items
zh_hans: 切换到"全部"查看所有内容

# filter.text
source: Text
zh_hans: 文本

# filter.title
source: Filter
zh_hans: 筛选

# freeLimit.count
source: History %lld/5 • Starred %lld/5
zh_hans: 历史 %1$lld/5 • 收藏 %2$lld/5

# freeLimit.title
source: Free Version Limit
zh_hans: 免费版限制

# image.compressionDescription
source: Original %@ → Compressed %@ (-%.1f%%)
zh_hans: 原图 %@ → 压缩后 %@ (-%.1f%%)

# imageViewer.source
source: Source: %@ • %@
zh_hans: 来源：%@ • %@

# keyboard.action.copy
source: Tap to Copy
zh_hans: 点击复制

# keyboard.action.insert
source: Tap to Insert
zh_hans: 点击插入

# keyboard.all
source: All
zh_hans: 全部

# keyboard.empty.all
source: No clipboard history yet Add content in the main app
zh_hans: 还没有剪贴板历史 在主App中添加内容

# keyboard.empty.image
source: No images yet Try sharing photos to ClipStack
zh_hans: 还没有图片 试试分享照片到ClipStack

# keyboard.empty.link
source: No links yet Try sharing web pages to ClipStack
zh_hans: 还没有链接 试试分享网页到ClipStack

# keyboard.empty.starred
source: No starred items yet Star frequently used items in the main app
zh_hans: 还没有收藏的内容 在主App中收藏常用内容

# keyboard.empty.text
source: No text content yet Try sharing text to ClipStack
zh_hans: 还没有文本内容 试试分享文字到ClipStack

# keyboard.filter.all
source: All
zh_hans: 全部

# keyboard.filter.image
source: Images
zh_hans: 图片

# keyboard.filter.link
source: Links
zh_hans: 链接

# keyboard.filter.starred
source: Starred
zh_hans: 收藏

# keyboard.filter.text
source: Text
zh_hans: 文本

# keyboard.imageCopied
source: Image Copied
zh_hans: 图片已复制

# keyboard.imageLoadFailed
source: Image Load Failed
zh_hans: 图片加载失败

# keyboard.loadMore
source: Scroll up to load more...
zh_hans: 上滑加载更多...

# keyboard.noPermission
source: Full Access Required
zh_hans: 需要开启"完全访问"

# keyboard.permission.gotIt
source: Got It
zh_hans: 我知道了

# keyboard.permission.message
source: Copying images to clipboard requires this permission Settings → General → Keyboard → ClipStack → Turn on "Allow Full Access"
zh_hans: 复制图片到剪贴板需要此权限 设置 → 通用 → 键盘 → ClipStack → 开启"允许完全访问"

# keyboard.permission.title
source: "Allow Full Access" Required
zh_hans: 需要开启"允许完全访问"

# keyboard.returnToSystem
source: Back to Keyboard
zh_hans: 返回系统键盘

# keyboard.text
source: Text
zh_hans: 文本

# log.autoDeleteOldItem
source: Auto-deleting oldest item
zh_hans: 自动删除最旧的条目

# log.checkingSubscription
source: Checking subscription status
zh_hans: 检查订阅状态

# log.cleanupCompleted
source: Cleaned up %lld old items
zh_hans: 已清理 %lld 条旧记录

# log.contentCopied
source: Content copied to clipboard
zh_hans: 内容已复制到剪贴板

# log.currentHistoryCount
source: Current unstarred items: %lld/%lld
zh_hans: 当前非收藏条目数：%lld/%lld

# log.currentStarredCount
source: Current starred items: %lld/%lld
zh_hans: 当前收藏数：%lld/%lld

# log.currentStatus
source: current status
zh_hans: 当前状态

# log.currentStatusLifetime
source: Current status: Lifetime
zh_hans: 当前状态: 终身买断

# log.currentStatusMonthly
source: Current status: Monthly
zh_hans: 当前状态: 月付订阅

# log.currentStatusNone
source: Current status: Not subscribed
zh_hans: 当前状态: 未订阅

# log.currentStatusYearly
source: Current status: Yearly
zh_hans: 当前状态: 年付订阅

# log.emailOpened
source: Email client opened
zh_hans: 已打开邮件客户端

# log.expiration
source: Expires
zh_hans: 到期

# log.listeningTransactions
source: Listening for transaction updates
zh_hans: 开始监听事务更新

# log.loadingProducts
source: Loading product list
zh_hans: 开始加载产品列表

# log.loadProductsFailed
source: Load products failed
zh_hans: 加载产品失败

# log.onboardingCompleted
source: Onboarding completed, won't show again
zh_hans: 引导流程已完成，下次启动不再显示

# log.onboardingReset
source: Onboarding reset, will show on next launch
zh_hans: 已重置引导流程，下次启动将重新显示

# log.preparingPurchase
source: Preparing purchase
zh_hans: 准备购买

# log.productNotFound
source: Selected product not found
zh_hans: 未找到选中的产品

# log.productsAlreadyLoaded
source: Products already loaded, skipping
zh_hans: 产品已加载，跳过重复请求

# log.productsCount
source: products
zh_hans: 共

# log.productsLoadedSuccess
source: Load successful
zh_hans: 加载成功

# log.proManagerInit
source: ProManager initialized
zh_hans: ProManager 初始化

# log.proStatusUpdated
source: Pro status updated
zh_hans: Pro 状态已更新

# log.purchaseCancelled
source: User cancelled purchase
zh_hans: 用户取消购买

# log.purchaseFailed
source: Purchase failed
zh_hans: 购买失败

# log.purchasePending
source: Purchase pending approval
zh_hans: 购买等待确认（家长批准或支付验证）

# log.purchaseSuccess
source: Purchase successful
zh_hans: 购买成功

# log.purchaseUnknown
source: Unknown purchase result
zh_hans: 未知购买结果

# log.receivedTransaction
source: Received new transaction
zh_hans: 收到新事务

# log.restoreFailed
source: Restore failed: %@
zh_hans: 恢复失败: %@

# log.restoreNoRecords
source: No valid purchase records found
zh_hans: 未找到有效购买记录

# log.restoreStart
source: Starting restore
zh_hans: 开始恢复购买

# log.restoreSuccess
source: Restore successful
zh_hans: 恢复购买成功

# log.settingsDataLoaded
source: Settings page data: History %lld, Starred %lld, Storage %@
zh_hans: 设置页面数据：历史 %1$lld，收藏 %2$lld，占用 %3$@

# log.startPurchase
source: Starting purchase
zh_hans: 开始购买

# log.storeHelperAvailable
source: StoreHelper available, loading products
zh_hans: StoreHelper 可用，开始加载产品...

# log.storeHelperInit
source: StoreHelper initialized
zh_hans: StoreHelper 初始化

# log.storeHelperUnavailable
source: StoreHelper unavailable (keyboard extension)
zh_hans: StoreHelper 不可用（当前环境：键盘扩展）

# log.subscriptionExpired
source: Subscription expired
zh_hans: 订阅已过期

# log.subscriptionPageOpened
source: Subscription management page opened
zh_hans: 已打开订阅管理页面

# log.transactionRevoked
source: Transaction revoked
zh_hans: 交易已撤销

# log.transactionVerifyFailed
source: Transaction verification failed
zh_hans: 事务验证失败

# log.unlockPro
source: Unlocking Pro
zh_hans: 解锁 Pro

# log.unlockProSilent
source: Silently unlocking Pro
zh_hans: 静默解锁 Pro

# log.verifyingPurchase
source: Verifying purchase
zh_hans: 开始验证购买

# onboarding.next
source: Next
zh_hans: 下一步

# onboarding.page1.feature1
source: Auto-save clipboard history
zh_hans: 自动保存剪贴板历史

# onboarding.page1.feature2
source: Support text, links, and images
zh_hans: 支持文本、链接和图片

# onboarding.page1.feature3
source: Star frequently used items
zh_hans: 收藏常用内容

# onboarding.page1.feature4
source: iCloud sync across devices
zh_hans: iCloud 跨设备同步

# onboarding.page1.subtitle
source: Powerful clipboard history manager
zh_hans: 强大的剪贴板历史管理工具

# onboarding.page1.title
source: Welcome to ClipStack
zh_hans: 欢迎使用 ClipStack

# onboarding.page2.footnote
source: We never collect your typed content. All data is stored locally.
zh_hans: 我们不会收集您的键入内容，所有数据仅保存在本地

# onboarding.page2.step1
source: Open Settings → General → Keyboard
zh_hans: 打开系统设置 → 通用 → 键盘

# onboarding.page2.step2
source: Tap "Keyboards" → "Add New Keyboard"
zh_hans: 点击"键盘"→"添加新键盘"

# onboarding.page2.step3
source: Select "ClipStack" and enable it
zh_hans: 选择"ClipStack"并开启

# onboarding.page2.step4
source: Enable "Allow Full Access" (required for copying images)
zh_hans: 开启"允许完全访问"（需要此权限才能复制图片）

# onboarding.page2.subtitle
source: Quickly insert history in any app
zh_hans: 在任何 App 中快速插入历史内容

# onboarding.page2.title
source: Add Custom Keyboard
zh_hans: 添加自定义键盘

# onboarding.page3.footnote
source: Supports small, medium, and large sizes
zh_hans: 支持小、中、大三种尺寸

# onboarding.page3.step1
source: Long press on home screen to enter edit mode
zh_hans: 长按主屏幕空白处进入编辑模式

# onboarding.page3.step2
source: Tap the + button in top-left corner
zh_hans: 点击左上角的 ＋ 按钮

# onboarding.page3.step3
source: Search for "ClipStack" and select it
zh_hans: 搜索"ClipStack"并选择

# onboarding.page3.step4
source: Drag to home screen to finish
zh_hans: 拖动到桌面并完成添加

# onboarding.page3.subtitle
source: Quick access to frequently used clips
zh_hans: 快速访问常用的剪贴内容

# onboarding.page3.title
source: Add Home Screen Widget
zh_hans: 添加桌面小组件

# onboarding.skip
source: Skip
zh_hans: 跳过

# onboarding.start
source: Get Started
zh_hans: 开始使用

# paywall.alertTitle
source: Purchase Result
zh_hans: 购买结果

# paywall.desc.lifetime
source: One-time purchase, use forever
zh_hans: 一次购买，永久使用

# paywall.desc.monthly
source: Pay monthly, cancel anytime
zh_hans: 按月支付，随时取消

# paywall.desc.yearly
source: Equivalent to $%.2f per month
zh_hans: 相当于每月 $%.2f

# paywall.discount.lifetime
source: Best Value
zh_hans: 最划算

# paywall.discount.yearly
source: Save 33%
zh_hans: 省 33%

# paywall.errorMessage
source: Please check your network connection and try again
zh_hans: 请检查网络连接后重试

# paywall.errorTitle
source: Unable to Load Products
zh_hans: 无法加载套餐

# paywall.failedMessage
source: Purchase Failed %@
zh_hans: 购买失败 %@

# paywall.feature1.desc
source: Save any number of clipboard items
zh_hans: 保存任意数量的剪贴板内容

# paywall.feature1.title
source: Unlimited History
zh_hans: 无限历史记录

# paywall.feature2.desc
source: Star important content without limits
zh_hans: 收藏重要内容不受限制

# paywall.feature2.title
source: Unlimited Stars
zh_hans: 无限收藏

# paywall.feature3.desc
source: Auto sync across devices (coming soon)
zh_hans: 多设备自动同步（即将推出）

# paywall.feature3.title
source: iCloud Sync
zh_hans: iCloud 同步

# paywall.feature4.desc
source: Early access to new features
zh_hans: 新功能优先体验

# paywall.feature4.title
source: Priority Support
zh_hans: 优先支持

# paywall.headerSubtitle
source: Unlimited use of ClipStack
zh_hans: 无限制使用 ClipStack

# paywall.headerTitle
source: Unlock All Features
zh_hans: 解锁全部功能

# paywall.loadingProducts
source: Loading products...
zh_hans: 加载套餐中...

# paywall.privacy
source: Privacy Policy
zh_hans: 隐私政策

# paywall.product.lifetime
source: Lifetime Purchase
zh_hans: 终身买断

# paywall.product.monthly
source: Monthly Subscription
zh_hans: 月付订阅

# paywall.product.yearly
source: Yearly Subscription
zh_hans: 年付订阅

# paywall.purchaseNow
source: Purchase Now
zh_hans: 立即购买

# paywall.recommended
source: 🔥 Most Popular
zh_hans: 🔥 最受欢迎

# paywall.reload
source: Reload
zh_hans: 重新加载

# paywall.restore
source: Restore Purchases
zh_hans: 恢复购买

# paywall.restoredMessage
source: ✅ Restore Successful! Pro access activated
zh_hans: ✅ 恢复购买成功！ Pro 版权限已激活

# paywall.successMessage
source: 🎉 Purchase Successful! All Pro features unlocked
zh_hans: 🎉 购买成功！ 已解锁 Pro 版全部功能

# paywall.terms
source: Terms of Service
zh_hans: 服务条款

# paywall.title
source: Upgrade to Pro
zh_hans: 升级到 Pro 版

# paywall.verifying
source: Verifying...
zh_hans: 验证中...

# search.noResults
source: No results for "%@"
zh_hans: 没有找到"%@"

# search.placeholder
source: Search history...
zh_hans: 搜索历史内容...

# search.tryOtherKeywords
source: Try different keywords or switch filter
zh_hans: 试试其他关键词或切换筛选类型

# settings.aboutHeader
source: About
zh_hans: 关于

# settings.accountHeader
source: Account
zh_hans: 账户

# settings.clearAction
source: Clear
zh_hans: 清空

# settings.clearHistory
source: Clear History
zh_hans: 清空历史记录

# settings.clearStarred
source: Clear Starred
zh_hans: 清空收藏

# settings.deleteAll
source: Delete All
zh_hans: 全部删除

# settings.feedback
source: Feedback
zh_hans: 意见反馈

# settings.freeVersion
source: Free Version
zh_hans: 免费版本

# settings.help
source: Help
zh_hans: 使用帮助

# settings.historyLabel
source: History
zh_hans: 历史记录

# settings.itemCount
source: %lld items
zh_hans: %lld 条

# settings.manageSubscription
source: Manage Subscription
zh_hans: 管理订阅

# settings.otherHeader
source: Other
zh_hans: 其他

# settings.proActivated
source: Pro Activated
zh_hans: Pro 版已激活

# settings.proVersion
source: Pro Version
zh_hans: Pro 版本

# settings.rateApp
source: Rate on App Store
zh_hans: App Store 评分

# settings.resetAll
source: Reset All
zh_hans: 完全重置

# settings.resetOnboarding
source: Show Onboarding Again
zh_hans: 重新显示引导

# settings.starredLabel
source: Starred
zh_hans: 收藏

# settings.storageFooter
source: • Clear History: Delete all non-starred items • Clear Starred: Delete all starred items • Reset All: Delete all data (cannot be undone)
zh_hans: • 清空历史记录：删除所有非收藏条目 • 清空收藏：删除所有收藏条目 • 完全重置：删除所有数据（不可恢复）

# settings.storageHeader
source: Storage Management
zh_hans: 存储管理

# settings.storageLabel
source: Storage
zh_hans: 占用空间

# settings.testTogglePro
source: Test: Toggle Pro Status
zh_hans: 测试：切换 Pro 状态

# settings.unlimitedThanks
source: Unlimited, thank you for your support!
zh_hans: 无限制，感谢支持！

# settings.upgradeToPro
source: Upgrade to Pro
zh_hans: 升级到 Pro 版

# settings.version
source: Version
zh_hans: 版本

# source.manual
source: Manual
zh_hans: 手动

# source.unknown
source: Unknown
zh_hans: 未知

# subscription.lifetime
source: Lifetime Purchase
zh_hans: 终身买断

# subscription.monthly
source: Monthly Subscription
zh_hans: 月付订阅

# subscription.none
source: Not Subscribed
zh_hans: 未订阅

# subscription.yearly
source: Yearly Subscription
zh_hans: 年付订阅

# success.clearHistory
source: ✅ Cleared %lld history items
zh_hans: ✅ 已清空 %lld 条历史记录

# success.clearStarred
source: ✅ Cleared %lld starred items
zh_hans: ✅ 已清空 %lld 条收藏

# success.coreDataLoaded
source: Core Data loaded successfully
zh_hans: Core Data 加载成功

# success.onboardingReset
source: ✅ Onboarding will show on next launch
zh_hans: ✅ 下次启动将显示引导

# success.resetAll
source: ✅ All data has been cleared
zh_hans: ✅ 已完全重置，所有数据已清空

# time.daysAgo
source: %lld days ago
zh_hans: %lld 天前

# time.hoursAgo
source: %lld hours ago
zh_hans: %lld 小时前

# time.justNow
source: Just now
zh_hans: 刚刚

# time.minutesAgo
source: %lld minutes ago
zh_hans: %lld 分钟前

# time.unknown
source: Unknown
zh_hans: 未知时间

# time.yesterday
source: Yesterday
zh_hans: 昨天

# toast.copied
source: ✅ Copied
zh_hans: ✅ 已复制

# toast.error
source: ❌ Error
zh_hans: ❌ 操作失败

# toast.imageCopied
source: ✅ Image Copied
zh_hans: ✅ 图片已复制

# toast.starred
source: ⭐ Starred
zh_hans: ⭐ 已收藏

# toast.starredFull
source: ⚠️ Starred limit reached (%lld/%lld)
zh_hans: ⚠️ 收藏已满（%1$lld/%2$lld）

# toast.unstarred
source: Unstarred
zh_hans: 取消收藏

source: Upgrade
zh_hans: 升级
